go-go-golems/esp32-s3-m5/ttmp/2026/08/20/ESP-60-M5STACKCHAN-NFC--esp-idf-st25r3916-nfc-reader-console-app-for-m5stackchan-intern-guide/sources/code/M5GFX-0.2.27-esp32-common.cpp
/*----------------------------------------------------------------------------/
  Lovyan GFX - Graphics library for embedded devices.

Original Source:
 https://github.com/lovyan03/LovyanGFX/

Licence:
 [FreeBSD](https://github.com/lovyan03/LovyanGFX/blob/master/license.txt)

Author:
 [lovyan03](https://twitter.com/lovyan03)

Contributors:
 [ciniml](https://github.com/ciniml)
 [mongonta0716](https://github.com/mongonta0716)
 [tobozo](https://github.com/tobozo)
/----------------------------------------------------------------------------*/
#if defined (ESP_PLATFORM)
#include <sdkconfig.h>

#include "common.hpp"

#include <algorithm>
#include <string.h>
#include <math.h>
#include <type_traits>

#include <freertos/FreeRTOS.h>
#include <freertos/semphr.h>

#if __has_include(<driver/i2c_master.h>)
 #include <driver/i2c_master.h>
#else
 #include <driver/i2c.h>
#endif
#include <driver/spi_common.h>
#include <driver/spi_master.h>
#include <driver/rtc_io.h>
#include <soc/rtc.h>
#include <soc/soc.h>
#include <soc/i2c_reg.h>
#include <soc/i2c_struct.h>
#if (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0))
 #if __has_include(<hal/i2c_ll.h>)
  #include <hal/i2c_ll.h>
  #if defined ( i2c_ll_reset_register ) || (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0))
   #if SOC_PERIPH_CLK_CTRL_SHARED
    #define I2C_CLOCK_SRC_ATOMIC() PERIPH_RCC_ATOMIC()
   #else
    #define I2C_CLOCK_SRC_ATOMIC()
   #endif
   #if !SOC_RCC_IS_INDEPENDENT
    #define I2C_RCC_ATOMIC() PERIPH_RCC_ATOMIC()
   #else
    #define I2C_RCC_ATOMIC()
   #endif
  #endif
 #endif

 #if __has_include(<soc/syscon_reg.h>)
  #include <soc/syscon_reg.h>
 #endif
#else
 #if __has_include (<soc/apb_ctrl_reg.h>)
  #include <soc/apb_ctrl_reg.h>
 #endif
#endif

#include <soc/efuse_reg.h>

#include <esp_log.h>

#if __has_include (<soc/soc_caps.h>)
#include <soc/soc_caps.h>
#endif

#if __has_include (<esp_private/periph_ctrl.h>)
 #include <esp_private/periph_ctrl.h>
#else
 #include <driver/periph_ctrl.h>
#endif

#if __has_include(<esp_arduino_version.h>)
 #include <esp_arduino_version.h>
#endif

// Whether the digital pads (pulls in IO_MUX) work independently of the RTC IO
// domain; only the plain ESP32 needs the RTC-domain path for RTC-capable pins.
// ESP-IDF v6 removed the SOC_GPIO_SUPPORT_RTC_INDEPENDENT macro, so derive
// the value from the build target when it is absent.
#if defined (SOC_GPIO_SUPPORT_RTC_INDEPENDENT)
 #define LGFX_GPIO_RTC_INDEPENDENT SOC_GPIO_SUPPORT_RTC_INDEPENDENT
#elif defined (CONFIG_IDF_TARGET) && !defined (CONFIG_IDF_TARGET_ESP32)
 #define LGFX_GPIO_RTC_INDEPENDENT 1
#else
 #define LGFX_GPIO_RTC_INDEPENDENT 0
#endif

#if __has_include(<esp_private/gpio.h>)
 #include <esp_private/gpio.h>
#endif

#include <initializer_list>

#if __has_include(<hal/gpio_ll.h>)
 #include <hal/gpio_ll.h>
#endif

#if __has_include(<esp_rom_gpio.h>)
 #include <esp_rom_gpio.h>
#endif

#if defined (ESP_IDF_VERSION_VAL)
 #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
  #include <hal/gpio_hal.h>
 #endif
 #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(3, 4, 0)

  #if defined (ESP_ARDUINO_VERSION_VAL)
   #if ESP_ARDUINO_VERSION < ESP_ARDUINO_VERSION_VAL(2, 0, 3)
     #define LGFX_EFUSE_WORKAROUND
   #endif
  #else
   #if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(4, 4, 0)
    #define LGFX_EFUSE_WORKAROUND
   #endif
  #endif

  #if defined ( LGFX_EFUSE_WORKAROUND )
// include <esp_efuse.h> でエラーが出るバージョンが存在するため、エラー回避用の記述を行ってからincludeする。;
   #define _ROM_SECURE_BOOT_H_
   #define MAX_KEY_DIGESTS 3
   struct ets_secure_boot_key_digests
   {
     const void *key_digests[MAX_KEY_DIGESTS];
     bool allow_key_revoke;
   };
   typedef struct ets_secure_boot_key_digests ets_secure_boot_key_digests_t;
  #endif
  #include <esp_efuse.h>
  #define USE_ESP_EFUSE_GET_PKG_VER
 #endif
#endif

#if __has_include(<soc/i2c_periph.h>)
 #include <soc/i2c_periph.h>
#endif

#if defined (SOC_GDMA_SUPPORTED)  // for C3/S3
 #if __has_include(<hal/gdma_ll.h>)
  #include <hal/gdma_ll.h>
 #endif
 #if __has_include(<soc/gdma_reg.h>)
  #include <soc/gdma_reg.h>
 #elif __has_include(<soc/axi_dma_reg.h>) // ESP32P4
  #include <soc/axi_dma_reg.h>
 #elif __has_include(<soc/ahb_dma_reg.h>) // ESP32C61
  #include <soc/ahb_dma_reg.h>
 #endif
 #if __has_include(<soc/gdma_struct.h>)
  #include <soc/gdma_struct.h>
 #elif __has_include(<soc/axi_dma_struct.h>) // ESP32P4
  #include <soc/axi_dma_struct.h>
 #elif __has_include(<soc/ahb_dma_struct.h>) // ESP32C61
  #include <soc/ahb_dma_struct.h>
 #endif
 // レジスタに異なる定義名がついているため、ここで統一;
 #if defined AXI_DMA_OUT_PERI_SEL_CH0_REG
  #define DMA_OUT_PERI_SEL_CH0_REG  AXI_DMA_OUT_PERI_SEL_CH0_REG
  #define DMA_IN_PERI_SEL_CH0_REG  AXI_DMA_IN_PERI_SEL_CH0_REG
 #elif defined AHB_DMA_OUT_PERI_SEL_CH0_REG
  #define DMA_OUT_PERI_SEL_CH0_REG  AHB_DMA_OUT_PERI_SEL_CH0_REG
  #define DMA_IN_PERI_SEL_CH0_REG  AHB_DMA_IN_PERI_SEL_CH0_REG
  #define DMA_PERI_OUT_SEL_CH0_M  AHB_DMA_PERI_OUT_SEL_CH0_M
  #define DMA_PERI_IN_SEL_CH0_M  AHB_DMA_PERI_IN_SEL_CH0_M
  #define SIZE_OF_DMA_CH (sizeof(AHB_DMA.channel[0]))
 #else
  #if __has_include(<soc/gdma_struct.h>)
   #if !defined (DMA_OUT_PERI_SEL_CH0_REG)
    #define DMA_OUT_PERI_SEL_CH0_REG  GDMA_OUT_PERI_SEL_CH0_REG
    #define DMA_IN_PERI_SEL_CH0_REG  GDMA_IN_PERI_SEL_CH0_REG
    #define DMA_PERI_OUT_SEL_CH0_M  GDMA_PERI_OUT_SEL_CH0_M
    #define DMA_PERI_IN_SEL_CH0_M  GDMA_PERI_IN_SEL_CH0_M
   #endif
  #endif
  #define SIZE_OF_DMA_CH (sizeof(GDMA.channel[0]))
 #endif

 #if !defined (SOC_GDMA_PAIRS_PER_GROUP_MAX)
  #if defined (SOC_GDMA_PAIRS_PER_GROUP)
   #define SOC_GDMA_PAIRS_PER_GROUP_MAX SOC_GDMA_PAIRS_PER_GROUP
  #elif defined (GDMA_LL_PAIRS_PER_INST)
   #define SOC_GDMA_PAIRS_PER_GROUP_MAX GDMA_LL_PAIRS_PER_INST
  #else
   #define SOC_GDMA_PAIRS_PER_GROUP_MAX 5
  #endif
 #endif
#endif

// GPIO_PIN_MUX_REG[] is declared extern in gpio_periph.h.
// ESP-IDF stopped providing the definition on chips with contiguous IO_MUX
// layout (ESP32-C5 etc.). Weak-link + fallback computation keeps this
// generic: no per-chip list to maintain when a new chip ships.
#include <soc/io_mux_reg.h>
extern "C" const uint32_t GPIO_PIN_MUX_REG[] __attribute__((weak));
static uint32_t _lgfx_io_mux_reg(size_t pin)
{
  return GPIO_PIN_MUX_REG ? GPIO_PIN_MUX_REG[pin] : (IO_MUX_GPIO0_REG + static_cast<uint32_t>(pin) * 4u);
}

namespace lgfx
{
 inline namespace v1
 {
//----------------------------------------------------------------------------
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Warray-bounds"
  static __attribute__ ((always_inline)) inline void writereg(uint32_t addr, uint32_t value) { *(volatile uint32_t*)addr = value; }
  static __attribute__ ((always_inline)) inline volatile uint32_t* reg(uint32_t addr) { return (volatile uint32_t *)ETS_UNCACHED_ADDR(addr); }
#pragma GCC diagnostic pop

  // ------- func_in_sel detect -------
  // func_sel/func_in_sel/in_sel: A type characteristic that detects the presence of members
  template <typename T, typename = void>
  struct has_func_sel : std::false_type {};

  template <typename T>
  struct has_func_sel<T, decltype(void(std::declval<T&>().func_sel))> : std::true_type {};

  template <typename T, typename = void>
  struct has_func_in_sel : std::false_type {};

  template <typename T>
  struct has_func_in_sel<T, decltype(void(std::declval<T&>().func_in_sel))> : std::true_type {};

