go-go-golems/esp32-s3-m5/ttmp/2026/08/20/ESP-60-M5STACKCHAN-NFC--esp-idf-st25r3916-nfc-reader-console-app-for-m5stackchan-intern-guide/sources/code/M5GFX-0.2.27-esp32-common.cpp
#if !defined ( I2C_CLOCK_SRC_ATOMIC )
  #if __cplusplus <= 201103L
    #define LGFX_PERIPH_MODULE_T periph_module_t
  #else
    #define LGFX_PERIPH_MODULE_T auto
  #endif

    __attribute__ ((unused))
        static LGFX_PERIPH_MODULE_T getPeriphModule(int num)
    {
#if LGFX_HP_I2C_NUM == 1
      return PERIPH_I2C0_MODULE;
#else
      return num == 0 ? PERIPH_I2C0_MODULE : PERIPH_I2C1_MODULE;
#endif
    }

  #undef LGFX_PERIPH_MODULE_T
#endif

    static i2c_dev_t* getDev(int num)
    {
#if LGFX_LP_I2C_NUM > 0
      // The register layout of the low power I2C matches the normal one, which is why
      // ESP-IDF publishes it as an i2c_dev_t as well. Everything below the port lookup
      // therefore works on it unchanged.
      if (isLpPort(num)) { return &LP_I2C; }
#endif
#if LGFX_HP_I2C_NUM == 1
      return &I2C0;
#else
      return num == 0 ? &I2C0 : &I2C1;
#endif
    }

#if defined ( I2C_CLOCK_SRC_ATOMIC )
    __attribute__ ((unused))
    static void i2c_periph_enable(int i2c_num)
    {
      I2C_RCC_ATOMIC() {
        i2c_ll_enable_bus_clock(i2c_num, true);
        i2c_ll_reset_register(i2c_num);
        (void)__DECLARE_RCC_ATOMIC_ENV;
      }
      I2C_CLOCK_SRC_ATOMIC() {
        i2c_ll_enable_controller_clock(I2C_LL_GET_HW(i2c_num), true);
        (void)__DECLARE_RCC_ATOMIC_ENV;
      }
    }

    __attribute__ ((unused))
    static void i2c_periph_disable(int i2c_num)
    {
      // periph_ll_disable_clk_clear_rst(mod);
      I2C_CLOCK_SRC_ATOMIC() {
        i2c_ll_enable_controller_clock(I2C_LL_GET_HW(i2c_num), false);
        (void)__DECLARE_RCC_ATOMIC_ENV;
      }
      I2C_RCC_ATOMIC() {
        i2c_ll_enable_bus_clock(i2c_num, false);
        (void)__DECLARE_RCC_ATOMIC_ENV;
      }
    }

    __attribute__ ((unused))
    static void i2c_periph_reset(int i2c_num)
    {
#if LGFX_LP_I2C_NUM > 0
      if (isLpPort(i2c_num))
      { // HP 用の i2c_ll_reset_register は SoC の PCR I2C 配列を範囲外参照するため LP 専用関数を使う;
        lp_i2c_ll_reset_register(i2c_num - LGFX_HP_I2C_NUM);
        return;
      }
#endif
      I2C_RCC_ATOMIC() {
        i2c_ll_reset_register(i2c_num);
        (void)__DECLARE_RCC_ATOMIC_ENV;
      }
    }
#else
    __attribute__ ((unused))
    static void i2c_periph_enable(int i2c_num)
    {
      auto mod = getPeriphModule(i2c_num);
      periph_module_enable(mod);
    }

    __attribute__ ((unused))
    static void i2c_periph_disable(int i2c_num)
    {
      auto mod = getPeriphModule(i2c_num);
      periph_module_disable(mod);
    }

    __attribute__ ((unused))
    static void i2c_periph_reset(int i2c_num)
    {
      auto mod = getPeriphModule(i2c_num);
      periph_module_reset(mod);
    }
#endif

#if defined ( CONFIG_IDF_TARGET_ESP32 ) || defined ( CONFIG_IDF_TARGET_ESP32S2 ) || !defined ( CONFIG_IDF_TARGET )

    static void updateDev(i2c_dev_t* dev)
    {
    }
    static volatile uint32_t* getFifoAddr(int num)
    {
      return (volatile uint32_t*)((num == 0) ? 0x6001301c : 0x6002701c);
    }

    static constexpr int i2c_cmd_start = 0;
    static constexpr int i2c_cmd_write = 1;
    static constexpr int i2c_cmd_read  = 2;
    static constexpr int i2c_cmd_stop  = 3;
    static constexpr int i2c_cmd_end   = 4;

#else

    static void updateDev(i2c_dev_t* dev)
    {
      dev->ctr.conf_upgate = 1;
    }
    static volatile uint32_t* getFifoAddr(int num)
    {
#if defined ( CONFIG_IDF_TARGET_ESP32C2 ) || defined ( CONFIG_IDF_TARGET_ESP32S3 ) || defined ( CONFIG_IDF_TARGET_ESP32C5 ) || defined ( CONFIG_IDF_TARGET_ESP32C6 ) || defined ( CONFIG_IDF_TARGET_ESP32C61 ) || defined ( CONFIG_IDF_TARGET_ESP32P4 ) || defined ( CONFIG_IDF_TARGET_ESP32H2 )
      return &(getDev(num)->data.val);
#else
      return &(getDev(num)->fifo_data.val);
#endif
    }

    static constexpr int i2c_cmd_start = 6;
    static constexpr int i2c_cmd_write = 1;
    static constexpr int i2c_cmd_read  = 3;
    static constexpr int i2c_cmd_stop  = 2;
    static constexpr int i2c_cmd_end   = 4;

#endif

    static constexpr int I2C_7BIT_ADDR_MIN = 0x08;
    static constexpr int I2C_7BIT_ADDR_MAX = 0x77;
    static constexpr int I2C_10BIT_ADDR_MAX = 1023;
    struct i2c_context_t
    {
      enum state_t
      {
        state_disconnect,
        state_write,
        state_read
      };
      cpp::result<state_t, error_t> state;

      SemaphoreHandle_t mtx = nullptr;

      void lock(uint32_t msec = portMAX_DELAY) {
        if (mtx == nullptr) {
          mtx = xSemaphoreCreateMutex();
        }
        xSemaphoreTake(mtx, msec);
      }

      void unlock(void) {
        xSemaphoreGive(mtx);
      }

      gpio_num_t pin_scl = (gpio_num_t)-1;
      gpio_num_t pin_sda = (gpio_num_t)-1;
      uint8_t wait_ack_stage = 0;   // 0:Not waiting. / 1:Waiting after addressing. / 2:Waiting during data transmission.
      bool initialized = false;
      uint32_t freq = 0;

      void save_reg(i2c_dev_t* dev)
      {
        auto reg = (volatile uint32_t*)dev;
#if defined ( CONFIG_IDF_TARGET_ESP32C2 ) || defined ( CONFIG_IDF_TARGET_ESP32S3 ) || defined ( CONFIG_IDF_TARGET_ESP32C5 ) || defined ( CONFIG_IDF_TARGET_ESP32C6 ) || defined ( CONFIG_IDF_TARGET_ESP32C61 ) || defined ( CONFIG_IDF_TARGET_ESP32P4 ) || defined ( CONFIG_IDF_TARGET_ESP32H2 )
        auto fifo_reg = (volatile uint32_t*)(&dev->data);
#else
        auto fifo_reg = (volatile uint32_t*)(&dev->fifo_data);
#endif
        for (size_t i = 0; i < sizeof(_reg_store) >> 2; ++i)
        {
          if (fifo_reg == &reg[i]) { continue; }
          _reg_store[i] = reg[i];
        }
      }

      void load_reg(i2c_dev_t* dev)
      {
        auto reg = (volatile uint32_t*)dev;
#if defined ( CONFIG_IDF_TARGET_ESP32C2 ) || defined ( CONFIG_IDF_TARGET_ESP32S3 ) || defined ( CONFIG_IDF_TARGET_ESP32C5 ) || defined ( CONFIG_IDF_TARGET_ESP32C6 ) || defined ( CONFIG_IDF_TARGET_ESP32C61 ) || defined ( CONFIG_IDF_TARGET_ESP32P4 ) || defined ( CONFIG_IDF_TARGET_ESP32H2 )
        auto fifo_reg = (volatile uint32_t*)(&dev->data);
#else
        auto fifo_reg = (volatile uint32_t*)(&dev->fifo_data);
#endif
        for (size_t i = 0; i < sizeof(_reg_store) >> 2; ++i)
        {
          if (fifo_reg == &reg[i]) { continue; }
          reg[i] = _reg_store[i];
        }
        updateDev(dev);
      }

      void setPins(i2c_dev_t* dev, gpio_num_t scl, gpio_num_t sda)
      {
        pin_sda = sda;
        pin_scl = scl;
#if defined ( ARDUINO ) && __has_include (<Wire.h>)
 #if defined ( ESP_IDF_VERSION_VAL )
  #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
   #if defined ARDUINO_ESP32_GIT_VER
    #if ARDUINO_ESP32_GIT_VER != 0x44c11981
     #define USE_TWOWIRE_SETPINS
    #endif
   #endif
  #endif
 #endif

#if LGFX_HP_I2C_NUM == 1
        auto twowire = &Wire;
#else
        auto twowire = ((dev == &I2C0) ? &Wire : &Wire1);
#endif

 #if defined ( USE_TWOWIRE_SETPINS )
        twowire->setPins(sda, scl);
 #else
        twowire->begin((int)sda, (int)scl);
 #endif
#endif
      }

// A low power port is opened through the ESP-IDF driver even in an Arduino build, where
// the normal ports go through TwoWire, so the handle is needed in both cases.
#if __has_include(<driver/i2c_master.h>) \
 && ( LGFX_LP_I2C_NUM > 0 || !( defined ( ARDUINO ) && __has_include (<Wire.h>) ) )
      i2c_master_bus_handle_t i2c_bus_handle = nullptr;
#endif
    private:
      uint32_t _reg_store[22];
    };
    i2c_context_t i2c_context[I2C_NUM_MAX];

    static inline bool isSoftPort(int i2c_port) { return i2c_port < 0; }

// ------------------------------------------------------------------------
// Software I2C ( soft_i2c.inl ), reached through the negative port numbers.
// pinMode() here puts a pin in open drain output with the latch high and the
// input stage enabled, so a line is driven and released by toggling the latch
// alone; the direction changing default of the fragment is not needed.

#define SOFT_I2C_LINE_LO(pin) gpio_lo(pin)
#define SOFT_I2C_LINE_HI(pin) gpio_hi(pin)
#define SOFT_I2C_LOCK(ctx) do { \
    if ((ctx).lock_handle == nullptr) { (ctx).lock_handle = xSemaphoreCreateMutex(); } \
    xSemaphoreTake((SemaphoreHandle_t)(ctx).lock_handle, portMAX_DELAY); \
  } while (0)
#define SOFT_I2C_UNLOCK(ctx) xSemaphoreGive((SemaphoreHandle_t)(ctx).lock_handle)
#define SOFT_I2C_YIELD() taskYIELD()
#define LGFX_INTERNAL_SOFT_I2C
#include "../soft_i2c.inl"

// ------------------------------------------------------------------------

#if LGFX_LP_I2C_NUM > 0 && SOC_RTCIO_PIN_COUNT > 0
    /// Hand a pin back from the low power IO domain.
    /// A pin routed to the low power I2C keeps that routing across a reset, because it is
    /// held in the low power domain rather than by the CPU. Any later attempt to drive it
    /// from a normal port then finds a pad that no longer reaches the peripheral, and the
    /// bus looks dead for reasons nothing in the running program explains. Releasing it
    /// here makes taking a pin over idempotent, whether or not the previous user shut
    /// down in an orderly way.
    static void releaseLpPad(gpio_num_t pin)
    {
      if ((int)pin >= 0 && rtc_gpio_is_valid_gpio(pin))
      {
        rtc_gpio_deinit(pin);
      }
    }
#endif

